fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <comment>Формирует реализации по всем действующим договорам абонентского обслуживания за выбранный месяц.</comment>
  <attributes>
    <name>Период</name>
    <comment>Любая дата месяца, за который формируются акты.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует реализации по договорам абонентского обслуживания за указанный месяц.
// Выполняется в фоновом задании через механизм длительных операций БСП.
//
// Данные всех договоров запрашиваются один раз до начала обхода: обращение
// к базе внутри цикла недопустимо.
//
// Параметры:
//  Параметры       - Структура - параметры выполнения:
//   * Период       - Дата      - любая дата месяца, за который создаются акты.
//   * Договоры     - Массив из СправочникСсылка.ДоговорыКонтрагентов - обрабатываемые договоры.
//  АдресРезультата - Строка    - адрес во временном хранилище для помещения результата.
//
Процедура СоздатьАктыВФоне(Знач Параметры, АдресРезультата) Экспорт
	
	ДанныеДоговоров = ДействующиеДоговоры(Параметры.Период);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Договор");
	Результат.Колонки.Добавить("Реализация");
	Результат.Колонки.Добавить("Результат");
	
	Для Каждого Договор Из Параметры.Договоры Цикл
		
		СтрокаРезультата = Результат.Добавить();
		СтрокаРезультата.Договор = Договор;
		
		НайденныеСтроки = ДанныеДоговоров.НайтиСтроки(Новый Структура("Договор", Договор));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаРезультата.Результат = НСтр("ru = 'Договор не действует в выбранном месяце'");
			Продолжить;
		КонецЕсли;
		
		ДанныеДоговора = НайденныеСтроки[0];
		
		Если ЗначениеЗаполнено(ДанныеДоговора.Реализация) Тогда
			СтрокаРезультата.Реализация = ДанныеДоговора.Реализация;
			СтрокаРезультата.Результат = НСтр("ru = 'Реализация за месяц уже создана'");
			Продолжить;
		КонецЕсли;
		
		Попытка
			СтрокаРезультата.Реализация = СоздатьРеализацию(ДанныеДоговора, Параметры.Период);
			СтрокаРезультата.Результат = НСтр("ru = 'Создана и проведена'");
		Исключение
			СтрокаРезультата.Результат = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Возвращает действующие в указанном месяце договоры абонентского обслуживания
// вместе с уже созданными за этот месяц реализациями.
//
// Параметры:
//  Период - Дата - любая дата месяца.
//
// Возвращаемое значение:
//  ТаблицаЗначений - данные договоров:
//   * Договор     - СправочникСсылка.ДоговорыКонтрагентов - договор абонентского обслуживания.
//   * Клиент      - СправочникСсылка.Контрагенты - владелец договора.
//   * Организация - СправочникСсылка.Организации - организация договора.
//   * Реализация  - ДокументСсылка.РеализацияТоваровУслуг - реализация за месяц, если создана.
//
Функция ДействующиеДоговоры(Знач Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор,
		|	Договоры.Владелец КАК Клиент,
		|	Договоры.Организация КАК Организация,
		|	ЕСТЬNULL(Реализации.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
		|		ПО Реализации.Договор = Договоры.Ссылка
		|			И Реализации.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			И НЕ Реализации.ПометкаУдаления
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И НЕ Договоры.ПометкаУдаления
		|	И Договоры.ВКМ_ДатаНачала <= &КонецПериода
		|	И Договоры.ВКМ_ДатаОкончания >= &НачалоПериода
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	Договор";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает и проводит реализацию по договору за указанный месяц.
// Реквизиты договора берутся из заранее полученных данных, обращения к базе нет.
//
// Параметры:
//  ДанныеДоговора - см. ДействующиеДоговоры
//  Период         - Дата - любая дата месяца.
//
// Возвращаемое значение:
//  ДокументСсылка.РеализацияТоваровУслуг - созданный документ.
//
Функция СоздатьРеализацию(ДанныеДоговора, Знач Период)
	
	Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	Документ.Дата = КонецМесяца(Период);
	Документ.Контрагент = ДанныеДоговора.Клиент;
	Документ.Организация = ДанныеДоговора.Организация;
	Документ.Договор = ДанныеДоговора.Договор;
	
	// Стандартный алгоритм заполнения документа.
	Документ.Заполнить(Неопределено);
	
	// Заполнение по условиям абонентского договора.
	Документ.ВКМ_ВыполнитьАвтозаполнение();
	
	// Штатная проверка заполнения здесь не подходит: у реализации обязателен
	// реквизит "Основание" со ссылкой на заказ покупателя, а акт абонентского
	// обслуживания создается по договору, без заказа. Поэтому проверяются
	// только реквизиты, без которых акт бессмыслен.
	Если Не ЗначениеЗаполнено(Документ.Организация)
		Или Не ЗначениеЗаполнено(Документ.Контрагент)
		Или Не ЗначениеЗаполнено(Документ.Договор) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнены организация, контрагент или договор'");
	КонецЕсли;

	Если Документ.Товары.Количество() = 0 И Документ.Услуги.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'По договору нечего выставлять за выбранный месяц'");
	КонецЕсли;
	
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Документ.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
